# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно,
# в программе.
list_1 = [None, 0, 0.05, "my_str", False, [10, 20, 30], (10, 20, 30),{10, 20, 30}]
for el in list_1:
    print(type(el))
