# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки нужно пронумеровать.
# Если слово длинное, выводить только первые 10 букв в слове.

list_1 = input("Введите слова через пробел: ").split()
a = 1
for el in list_1:
    if len(el) > 10:
        print(f"{a}. {el[:10]}")
    else:
        print(f"{a}. {el}")
    a += 1
